### [DataFrame의 인덱스 다루기 -2]
- 새로운 행 인덱스를 생성 및 적용
- 메서드 : 변수명.reindex(새로운인덱스, fill_value)

In [5]:
# [1] 모듈 로딩
import pandas as pd

In [6]:
# [2] 데이터 준비
jumsu={'name':['마징가','태권V','원더우먼'],
       'kor':[89,98,99],
       'eng':[89,78,68],
       'math':[99,98,97]
       }

In [7]:
# [3] DF로 저장
JumsuDF=pd.DataFrame(jumsu)
JumsuDF

   name  kor  eng  math
0   마징가   89   89    99
1   태권V   98   78    98
2  원더우먼   99   68    97

In [12]:
# [4] 행 인덱스 새롭게 생성
new_index=[0,1,'r0','r1','r2']
DF2=JumsuDF.reindex(new_index)
DF2

   name   kor   eng  math
0   마징가  89.0  89.0  99.0
1   태권V  98.0  78.0  98.0
r0  NaN   NaN   NaN   NaN
r1  NaN   NaN   NaN   NaN
r2  NaN   NaN   NaN   NaN

In [15]:
# [5] - 존재하지 않는 행에 값 설정
DF3=JumsuDF.reindex([0,'r0','r2',1],fill_value=0)
DF3

   name  kor  eng  math
0   마징가   89   89    99
r0    0    0    0     0
r2    0    0    0     0
1   태권V   98   78    98